WebSquare.WebSquareLang = {
    	
		//#########################################################################
		// 한글 (ko.js)에 붙여넣기
		//#########################################################################
		//==========================================================================
		// ETC MSG 추가
		//==========================================================================
		 ETC_OUTPUT_MESSAGE_00001 : "에러코드 : {0}\n에러메시지 : {1}"
		, ETC_OUTPUT_MESSAGE_00002 : "조회되었습니다."
		, ETC_OUTPUT_MESSAGE_00003 : "등록되었습니다."
		, ETC_OUTPUT_MESSAGE_00004 : "수정되었습니다."
		, ETC_OUTPUT_MESSAGE_00005 : "삭제되었습니다."
		, ETC_OUTPUT_MESSAGE_00006 : "저장하시겠습니까?"
		, ETC_OUTPUT_MESSAGE_00007 : "수정하시겠습니까?"
		, ETC_OUTPUT_MESSAGE_00008 : "삭제하시겠습니까?"
			
		//==========================================================================
		// 공통
		//==========================================================================		
		, COMMON_MSG_00001 : "수행중 오류가 발생하였습니다."	
			  
		//==========================================================================
		// 공통 LABEL
		//==========================================================================
		, COMMON_LABEL_00001 : "페이지 크기"
		, COMMON_LABEL_00002 : "총"
		, COMMON_LABEL_00003 : "건"
		, COMMON_LABEL_00004 : "번호"
		, COMMON_LABEL_00005 : "페이지"
		, COMMON_LABEL_00006 : "등록"
		, COMMON_LABEL_00007 : "수정"
		, COMMON_LABEL_00008 : "알림"
		, COMMON_LABEL_00009 : "확인"
		, COMMON_LABEL_00010 : "사용여부"
		, COMMON_LABEL_00011 : "삭제여부"
		, COMMON_LABEL_00012 : "정렬순서"
		, COMMON_LABEL_00013 : "상태" 
		
		
		//==========================================================================
		// 공통 BUTTON
		//==========================================================================
		, COMMON_BUTTON_00001 : "조회"
		, COMMON_BUTTON_00002 : "초기화"
		, COMMON_BUTTON_00003 : "저장"
		, COMMON_BUTTON_00004 : "삭제"
		, COMMON_BUTTON_00005 : "선택"
		, COMMON_BUTTON_00006 : "선택안함"
		, COMMON_BUTTON_00007 : "확인"
		, COMMON_BUTTON_00008 : "취소"
		, COMMON_BUTTON_00009 : "닫기"
		, COMMON_BUTTON_00010 : "적용"
		, COMMON_BUTTON_00011 : "추가"
		, COMMON_BUTTON_00012 : "보기"
		, COMMON_BUTTON_00013 : "생성"
		, COMMON_BUTTON_00014 : "다운로드"
			

		//==========================================================================
		// 공통 SELECT
		//==========================================================================
		, COMMON_SELECT_00001 : "- 전체 -"
		, COMMON_SELECT_00002 : "- 선택 -"
		, COMMON_SELECT_00003 : "- 구분 -"
		, COMMON_SELECT_00004 : "사용"
		, COMMON_SELECT_00005 : "미사용"
		, COMMON_SELECT_00006 : "등록"
		, COMMON_SELECT_00007 : "미등록"
		, COMMON_SELECT_00008 : "체크"
		, COMMON_SELECT_00009 : "미체크"
		, COMMON_SELECT_00010 : "적용"
		, COMMON_SELECT_00011 : "미적용"
		, COMMON_SELECT_00012 : "예"
		, COMMON_SELECT_00013 : "아니오"
		, COMMON_SELECT_00014 : "전역설정"
		, COMMON_SELECT_00015 : "ON"
		, COMMON_SELECT_00016 : "DEBUG"
		, COMMON_SELECT_00017 : "INFO"
		, COMMON_SELECT_00018 : "WARN"
		, COMMON_SELECT_00019 : "ERROR"
		, COMMON_SELECT_00020 : "FATAL"
		, COMMON_SELECT_00021 : "OFF"
		, COMMON_SELECT_00022 : "임시삭제"
		, COMMON_SELECT_00023 : "삭제"
		, COMMON_SELECT_00024 : "포함"
		, COMMON_SELECT_00025 : "미포함"
		, COMMON_SELECT_00026 : "출력"
		, COMMON_SELECT_00027 : "미출력"
		

		//==========================================================================
		// 공통 MESSAGE
		//==========================================================================
		, COMMON_MESSAGE_00001 : "{0} 은(는) 필수 입력 값입니다."
		, COMMON_MESSAGE_00002 : "{0} 은(는) 필수 선택 값입니다."
		, COMMON_MESSAGE_00003 : "{0} 을(를) 저장하시겠습니까?"
		, COMMON_MESSAGE_00004 : "{0} 을(를) 삭제하시겠습니까?"
		, COMMON_MESSAGE_00005 : "{0} 을(를) 입력하세요."
		, COMMON_MESSAGE_00006 : "{0} 을(를) 선택하세요."
		, COMMON_MESSAGE_00007 : "{0} 을(를) 설정하세요."
		, COMMON_MESSAGE_00008 : "{0} 이(가) 중복입니다."
		, COMMON_MESSAGE_00009 : "세션이 존재하지 않습니다."

		//==========================================================================
		// elListView.xml
		//==========================================================================
		, EMP_LIST_VIEW_SELECT_00001 : "연구원"
		, EMP_LIST_VIEW_SELECT_00002 : "사무원"
		, EMP_LIST_VIEW_SELECT_00003 : "관리자"
		, EMP_LIST_VIEW_SELECT_00004 : "대표"
		, EMP_LIST_VIEW_SELECT_00005 : "판매원"
		, EMP_LIST_VIEW_SELECT_00006 : "회계팀"
		, EMP_LIST_VIEW_SELECT_00007 : "연구팀"
		, EMP_LIST_VIEW_SELECT_00008 : "영업팀"
		, EMP_LIST_VIEW_SELECT_00009 : "운영팀"
		
		//#########################################################################
		// langpack(*.js)에 붙여넣기
		//#########################################################################
			
		//==========================================================================
		// CRUD 템플릿 생성 (/@웹스퀘어 패키지@/Test.xml)
		//==========================================================================
		, Test_OUTPUT_LABEL_90001 : "부서정보"
		, Test_OUTPUT_LABEL_90002 : "부서정보 리스트"
		, Test_OUTPUT_LABEL_90003 : "부서정보 상세보기"

		, Test_SEARCH_00001 : "DEPTNO"
		, Test_COLNAME_00001 : "DEPTNO"
		, Test_COLNAME_00002 : "DNAME"
		, Test_COLNAME_00003 : "LOC"
			
		//==========================================================================
		// ETC MSG 추가
		//==========================================================================
		, ETC_OUTPUT_MESSAGE_00001 : "에러코드 : {0}\n에러메시지 : {1}"
		, ETC_OUTPUT_MESSAGE_00002 : "조회되었습니다."
		, ETC_OUTPUT_MESSAGE_00003 : "등록되었습니다."
		, ETC_OUTPUT_MESSAGE_00004 : "수정되었습니다."
		, ETC_OUTPUT_MESSAGE_00005 : "삭제되었습니다."
		, ETC_OUTPUT_MESSAGE_00006 : "저장하시겠습니까?"
		, ETC_OUTPUT_MESSAGE_00007 : "수정하시겠습니까?"
		, ETC_OUTPUT_MESSAGE_00008 : "삭제하시겠습니까?"
				
		//==========================================================================
		// WRM MSG 추가
		//==========================================================================
		, MSG_CM_00001: "변경된 데이터를 저장하시겠습니까?"
	    , MSG_CM_00002: "$[1] 필수입력값입니다."
	    , MSG_CM_00003: "$[1] 로그인 화면으로 이동하겠습니다."
	    , MSG_CM_00004: "서버가 정지된 상태입니다. 자세한 내용은 관리자에게 문의하시기 바랍니다."
	    , MSG_CM_00005: "변경된 데이터가 없습니다."
	    , MSG_CM_00006: "창을 닫으시겠습니까? 변경사항이 저장되지 않을 수 있습니다."
	    , MSG_CM_00007: "$[1] 파일의 크기가 $[2]를 초과 했습니다."
	    , MSG_CM_00008: "업로드 가능한 전체 파일 개수 $[1]개를 초과 했습니다."
	    , MSG_CM_00009: "업로드 가능한 전체 파일 용량 $[1]를 초과 했습니다"
	    , MSG_CM_00010: "진행하시겠습니까?"
	    , MSG_CM_00011: "해당 코드 그룹 및 코드 데이터가 저장됩니다."
	    , MSG_CM_00012: "해당 코드 그룹 데이터가 저장됩니다."
	    , MSG_CM_00013: "해당 코드 데이터가 저장됩니다."
	    , MSG_CM_00014: "코드 그룹 선택후 코드를 등록하실 수 있습니다."
	    , MSG_CM_00015: "코드 그룹 등록 후에 사용 가능합니다."
	    , MSG_CM_00016: "권한별 등록사원부터 삭제하셔야 합니다."
	    , MSG_CM_00017: "권한 선택후 권한별 등록사원을 등록하실 수 있습니다."
	    , MSG_CM_00018: "권한 등록 후에 사용 가능합니다."
	    , MSG_CM_00019: "해당 권한에 대한 권한별 등록사원 정보도 함께 저장됩니다."
	    , MSG_CM_00020: "해당 권한 데이터가 저장됩니다."
	    , MSG_CM_00021: "해당 권한에 대한 권한별 등록사원 정보도 함께 저장됩니다."
	    , MSG_CM_00022: "조회 후 이용하세요."
	    , MSG_CM_00023: "해당 프로그램에 대한 프로그램별 접근권한 정보도 함께 저장됩니다."
	    , MSG_CM_00024: "해당 프로그램에 정보가 저장됩니다."
	    , MSG_CM_00025: "해당 프로그램에 대한 프로그램별 접근 권한이 저장됩니다."
	    , MSG_CM_00026: "프로그램 선택후 프로그램별 접근 권한을 등록하실 수 있습니다."
	    , MSG_CM_00027: "프로그램 등록 후에 사용 가능합니다."
	    , MSG_CM_00028: "건의 데이타를 반영하시겠습니까?"
	    , MSG_CM_00029: "메뉴코드를 클릭하셔야 합니다."
	    , MSG_CM_00030: " 메뉴 하위에 새로운 메뉴를 추가하시겠습니까? [아니오]를 누르면 동일한 레벨에 메뉴가 생성됩니다."
	    , MSG_CM_00031: "데이터를 저장 하시겠습니까?"
	    , MSG_CM_00032: "저장할 데이터가 없습니다."
	    , MSG_CM_00033: "새로 생성할 파일 그룹의 부모 파일 그룹을 선택하세요."
	    , MSG_CM_00034: "하위 파일 그룹이 존재하여 삭제할 수 없습니다."
	    , MSG_CM_00035: "삭제할 파일 그룹에 첨부 파일이 존재하여 삭제할 수 없습니다."
	    , MSG_CM_00036: "선택한 파일 그룹을 삭제하시겠습니까?"
	    , MSG_CM_00037: "기존 프로그램에 변경된 단축키가 존재합니다. 변경된 단축키를 저장하시겠습니까?"
	    , MSG_CM_00038: "해당 프로그램에 대한 단축키가 저장됩니다. 진행하시겠습니까? "
	    , MSG_CM_00039: "이미 동일한 단축키가 존재 합니다."
	    , MSG_CM_00040: "소속코드를 클릭하셔야 합니다."
	    , MSG_CM_00041: "가족관계정보 프로젝트정보 부터 삭제하셔야 합니다."
	    , MSG_CM_00042: "변경된 사원 정보를 저장하시겠습니까?"
	    , MSG_CM_00043: "변경된 정보가 있습니다. 저장하지 않고 닫으시겠습니까?"
	    , MSG_CM_00044: "우편번호를 선택하시기 바랍니다."
	    , MSG_CM_00045: "변경된 사원 정보가 없습니다."
	    , MSG_CM_00046: "알림"
	    , MSG_CM_00047: "확인"
	    , MSG_CM_00048: "변경된 데이터를 저장한 후에 데이터 이동이 가능합니다."
	    , MSG_CM_00049: "변경된 정보가 있습니다. 저장하지 않고 조회시겠습니까?"
	    , MSG_CM_00050: "변경된 데이터를 저장한 후에 데이터 추가가 가능합니다."
	    , MSG_CM_00051: "이 샘플은 Internet Explorer를 지원하지 않습니다."
	    , MSG_CM_00052: "변경된 정보가 있습니다. 저장하지 않고 취소시겠습니까?"
	    , MSG_CM_00053: "사원코드"
	    , MSG_CM_00054: "사원명"
	    , MSG_CM_00055: "입사일"
	    , MSG_CM_00056: "주민번호"
	    , MSG_CM_00057: "사원한자명"
	    , MSG_CM_00058: "담당업무"
	    , MSG_CM_00059: "사원영문명"
	    , MSG_CM_00060: "호칭변경일"
	    , MSG_CM_00061: "최종발령일"
	    , MSG_CM_00062: "한글만 입력가능"
	    , MSG_CM_00063: "기본코드"
	    , MSG_CM_00064: "기본사항"
	    , MSG_CM_00065: "입력사항"
	    , MSG_CM_00066: "확인사항"
	    , MSG_CM_00067: "엑셀 파일이 정상적으로 생성되지 않았습니다."

}
